# -*- coding: utf-8 -*-
"""Chapter: story 6: 「涙の大河」
"""
## path
import os
import sys
sys.path.append(os.path.join(os.path.dirname(__file__), '../..'))
sys.path.append('storybuilder')
## local libs
from storybuilder.builder.world import World
from storybuilder.builder.writer import Writer
## local files


## define alias
W = Writer
_ = W.getWho()

## scenes
def sc_main(w: World):
    eika, cho = W(w.eika), W(w.chomei)
    inside, outside = W(w.inside), W(w.outside)
    return w.scene("main",
            eika.be(),
　ゆるりと立ち昇る靄を抜けると、向こう岸が見えないほど広い川に出た。そこでじっとたゆたう水面を見つめて泣く女が一人。彼女にあなたは問いかけた。

「何故、泣いているのですか」


　　　※


　まだ西暦が始まる前のこと。随分と湿気の多い空気の中、ひょろり伸びた豆を収穫していた王詠華は、服を泥だらけにした夫の長明の姿を見て声をかけた。

「あなた。もういい加減にして下さい。あの川をどうにかしようなど、神様でもきっと無理なのですから」
「神に無理だからと言って俺にも無理かどうかは分からない。もう二度と洪水で悲しい思いをしたくはない」


　詠華が嫁いできた淀里の住民はよくも悪くも、複雑な支流を持つ七龍川に影響されて暮らしていた。雨季になる度に洪水で里を押し流すが、その川がもたらす養分により貧しい土地で何とか作物を収穫することが出来た。


　薄木の板を張り合わせたぼろ屋に戻ると、詠華は覚悟を決め、桶の水を被っている長明に言った。

「洪水は確かに困るけれど、それは淀里の歴史の一部なのでしょう。あれがあるから私たちは生きていられる」
「それは最初から何も出来ないと考え何もしてこなかった、ただその放置の歴史の積み重ねではないのか」

　長明の両親は洪水で死んだ。それを聞かされた時、詠華は彼の気持ちを理解出来なかった訳では無い。それでも彼が幾度となく住民に迷惑を掛けていることを考えると、もういい加減に諦めてももらいたかった。

「このままではいつかあなたまで犠牲に」
「それでも構わない。神には自分を犠牲にする覚悟などないからな。それが人間との大きな違いだ」
「私を一人残して、それでも構わないと？」

　だがそれには長明は答えなかった。


　今年の雨季は例年より早くにやってきた。


　既に里の住民は避難を始めていて、詠華も最低限の家財道具を持ち出そうとまとめていた。

「詠華さん、早く避難を」
「あの人が、まだ帰ってこないんです！」
「長明も馬鹿ではない。もう避難しているさ。さあ、早く！」

　詠華は近所の者に言われるまま、里を見下ろす高台まで避難したが、そこに夫の姿は無かった。


　雨は三日三晩の間ずっと降り続いた。


　雨が上がると直ぐに詠華は里へと下りて行った。

「一体、これは……」

　いつもなら増水してまだ里はとても歩ける状態ではないのに、何故か水は殆どなく、家々も流されてはいなかった。
　里の傍を流れる七龍川は、たっぷりの水量を湛えて流れていたが、その淵には石が埋め込まれ、よく見れば今までの倍の川幅となっていた。詠華はそれが夫の仕業なのだと悟った。

「長明」

　夫の名はその川面を僅かに揺らしただけだった。


　　　※


「前世なんてものを私は信じてやいません。それでも何故この川を見て涙が溢れるというのでしょう」

　目の前の川はどこまでも穏やかに流れていた。


            w.symbol("（了）"),
            camera=w.eika,
            stage=w.on_field,
            day=w.in_current, time=w.at_afternoon,
            )

## episode
def ep_main(w: World):
    return w.episode("大河",
            sc_main(w),
            ## NOTE
            )

## chapter
def ch006_tearsriver(w: World):
    return w.chapter("＃００６　【歴史】　涙の大河",
            ep_main(w),
            )
