# -*- coding: utf-8 -*-
"""Story config.
"""
################################################################
#
# Sample:
#
# 1) PERSONS
#       人物簡易設定
# 2) AREAS
#       エリア設定
# 3) STAGES
#       舞台基本設定
# 4) DAYS
#       年月日設定
# 5) TIMES
#       時間帯基本設定
# 6) ITEMS
#       小道具設定
# 7) WORDS
#       辞書設定
# 8) RUBIS
#       ルビ設定
# 9) LAYERS
#       レイヤ設定
#
################################################################


PERSONS = (
        # Tag / 氏,名 / 歳 / 誕生日 / 性別 / 職業 / 呼称 / 紹介
        ("taro", "太郎", "", 20,(1,1), "male", "主人公"),
        ("man1", "男", "", 30,(1,1), "male", "会社員"),
        ("woman1", "女", "", 30,(1,1), "male", "会社員"),
        ("police", "警官", "", 30,(1,1), "male", "警官"),
        ## 001
        ("yuki", "由岐", "", 30,(1,1), "female", "人形師", "me:私"),
        ("hiro", "浩史", "", 35,(1,1), "male", "投資家", "me:俺"),
        ## 002
        ("ane", "亜希", "野依,亜希", 30,(1,1), "female", "会社員", "me:私"),
        ("mika", "美佳", "野依,美佳", 28,(1,1), "female", "会社員", "me:わたし"),
        ("kiri", "桐山", "", 40,(1,1), "male", "画家", "me:僕"),
        ## 003
        ("yui", "結衣", "", 16,(1,1), "female", "病人", "me:わたし"),
        ("yuidad", "父", "", 40,(1,1), "male", "実業家", "me:私"),
        ("gekko", "ゲッコウ", "月乃,幸輔", 30,(1,1), "male", "謎の男", "me:俺"),
        ### 004
        ("vector", "ベクター", "ベクター,トーレ", 60,(1,1), "male", "博士", "me:私"),
        ("digibutterfly", "電子蝶", "", 99,(1,1), "male", "蝶", "me:私"),
        ("robber", "強盗", "", 40,(1,1), "male", "強盗", "me:オレ"),
        ### 005
        ("eiji", "英嗣", "黒川,英嗣", 28,(1,1), "male", "会社員", "me:俺"),
        ("junko", "純子", "美濃部,純子", 28,(1,1), "female", "会社員", "me:わたし"),
        ### 006
        ("eika", "詠華", "", 30,(1,1), "female", "農夫", "me:私"),
        ("chomei", "長明", "", 35,(1,1), "male", "農夫", "me:俺"),
        # 007
        ('mitsu', '美津', '', 30,(1,1), 'female', 'OL', 'me:私'),
        ('yoshida', '吉田', '', 40,(1,1), 'male', '会社員', 'me:僕'),
        )

STAGES = (
        # Tag / 名前 / Parent / Geometry / 紹介
        ('Tokyo', '東京', '', (100,100)),
        ('Moscow', 'モスクワ', '', (1000,50)),
        ("field", "大地", "Tokyo",),
        ## 001
        ("yakata", "人形の館", "Tokyo"),
        ## 004
        ("vectorroom", "博士の部屋", "Moscow"),
        # 007
        ('manshion_mitsu', '美津のマンション', 'Tokyo'),
        )

DAYS = (
        # Tag / 名前 / 月 / 日 / 年
        ("current", "current", 1,1,2020),
        ## 001
        )

TIMES = (
        # Tag / 名前 / 時 / 分
        )

ITEMS = (
        # Tag / 名前 / 紹介
        )

WORDS = (
        # Tag / 名前 / 紹介
        ### 004
        ("inputcmd", "> Please input command."),
        )

RUBIS = (
        # Base / Rubi / Exclusion / Type
        ("袖", "｜袖《そで》"),
        ("捲り上げた", "｜捲《まく》り上げた"),
        ("逞しい", "｜逞《たくま》しい"),
        ("風呂敷包", "｜風呂敷包《ふろしきづつみ》"),
        ("拭った", "｜拭《ぬぐ》った"),
        ("歪める", "｜歪《ゆが》める"),
        ("随分", "｜随分《ずいぶん》"),
        ("頬", "｜頬《ほお》"),
        ("遮って", "遮《さえぎ》って"),
        ("顰め", "｜顰《しか》め"),
        ("噤んだ", "｜噤《つぐ》んだ"),
        ("暫く", "｜暫《しばら》く"),
        ("蝋燭", "｜蝋燭《ろうそく》"),
        ("微か", "｜微《かす》か"),
        ## 002
        ("幾何学", "｜幾何学《きがかく》"),
        ("顎", "｜顎《あご》"),
        ("滑らか", "｜滑《なめ》らか"),
        ("漏ら", "｜漏《も》ら"),
        ("髭", "｜髭《ひげ》"),
        ## 003
        ("月乃幸輔", "｜月乃幸輔《つきのこうすけ》"),
        ("嘲笑", "｜嘲笑《ちょうしょう》"),
        ("洩らす", "｜洩《も》らす"),
        ## 004
        ("掠めて", "｜掠《かす》めて"),
        ("反芻", "｜反芻《はんすう》"),
        ## 005
        ("黒川英嗣", "｜黒川英嗣《くろかわえいじ》"),
        ("鼓膜", "｜鼓膜《こまく》"),
        ("躓く", "｜躓《つまず》く"),
        ("掻っ攫って", "｜掻《か》っ｜攫《さら》って"),
        ("揶揄", "｜揶揄《やゆ》"),
        ("捻れ", "｜捻《ねじ》れ"),
        ## 006
        ("靄", "｜靄《もや》"),
        ("王詠華", "｜王詠華《おうえいか》"),
        ("長明", "｜長明《ちょうめい》"),
        ("淀里", "｜淀里《てんり》"),
        ("湛えて", "｜湛《たた》えて"),
        )

